vkatsageorgiou/Stellarisware-1/boards/ek-lm3s3748/usb_host_msc/usb_host_msc.c
//*****************************************************************************
//
// usbhost.c - main routine for the USB MSC example.
//
// Copyright (c) 2008-2009 Luminary Micro, Inc.  All rights reserved.
// Software License Agreement
// 
// Luminary Micro, Inc. (LMI) is supplying this software for use solely and
// exclusively on LMI's microcontroller products.
// 
// The software is owned by LMI and/or its suppliers, and is protected under
// applicable copyright laws.  All rights are reserved.  You may not combine
// this software with "viral" open-source software in order to form a larger
// program.  Any use in violation of the foregoing restrictions may subject
// the user to criminal sanctions under applicable laws, as well as to civil
// liability for the breach of the terms and conditions of this license.
// 
// THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
// OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
// MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
// LMI SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
// CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 4781 of the EK-LM3S3748 Firmware Package.
//
//*****************************************************************************

#include <string.h>
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/systick.h"
#include "driverlib/udma.h"
#include "driverlib/usb.h"
#include "grlib/grlib.h"
#include "usblib/usblib.h"
#include "usblib/usbmsc.h"
#include "usblib/host/usbhost.h"
#include "usblib/host/usbhmsc.h"
#include "fatfs/src/ff.h"
#include "drivers/buttons.h"
#include "drivers/formike128x128x16.h"

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>USB Mass Storage Class Host (usb_host_msc)</h1>
//!
//! This example application demonstrates how to connect a USB mass storage
//! class device to the evaluation kit.  When a device is detected, the
//! application displays the contents of the file system and allows browsing
//! using the buttons.
//
//*****************************************************************************

//*****************************************************************************
//
// Colors used by the display.
//
//*****************************************************************************
#define FILE_COLOR              ClrWhite
#define DIR_COLOR               ClrBlue
#define BACKGROUND_COLOR        ClrBlack

//*****************************************************************************
//
// Screen and font settings, these determine some fixed memory allocations
// by the application.
//
//*****************************************************************************
#define SCREEN_HEIGHT           128
#define FONT_HEIGHT             8
#define SPLASH_HEIGHT           15
#define TOP_HEIGHT              (SPLASH_HEIGHT + 4)

//*****************************************************************************
//
// Current FAT fs state.
//
//*****************************************************************************
static FATFS g_sFatFs;

//*****************************************************************************
//
// The graphical Context state.
//
//*****************************************************************************
tContext g_sContext;

//*****************************************************************************
//
// The size of the host controller's memory pool in bytes.
//
//*****************************************************************************
#define HCD_MEMORY_SIZE         128

//*****************************************************************************
//
// The memory pool to provide to the Host controller driver.
//
//*****************************************************************************
unsigned char g_pHCDPool[HCD_MEMORY_SIZE];

//*****************************************************************************
//
// The instance data for the MSC driver.
//
//*****************************************************************************
unsigned long g_ulMSCInstance = 0;

//*****************************************************************************
//
// Declare the USB Events driver interface.
//
//*****************************************************************************
DECLARE_EVENT_DRIVER(g_sUSBEventDriver, 0, 0, USBHCDEvents);

//*****************************************************************************
//
// The global that holds all of the host drivers in use in the application.
// In this case, only the MSC class is loaded.
//
//*****************************************************************************
static tUSBHostClassDriver const * const g_ppHostClassDrivers[] =
{
    &g_USBHostMSCClassDriver
    ,&g_sUSBEventDriver
};

//*****************************************************************************
//
// This global holds the number of class drivers in the g_ppHostClassDrivers
// list.
//
//*****************************************************************************
static const unsigned long g_ulNumHostClassDrivers =
    sizeof(g_ppHostClassDrivers) / sizeof(tUSBHostClassDriver *);

//*****************************************************************************
//
// The defines used with the g_ulButtons variable.
//
//*****************************************************************************
#define BUTTON_UP_CLICK         0x00000001
#define BUTTON_DOWN_CLICK       0x00000002
#define BUTTON_LEFT_CLICK       0x00000004
#define BUTTON_RIGHT_CLICK      0x00000008
#define BUTTON_SELECT_CLICK     0x00000010

//*****************************************************************************
//
// This global holds the current button events.
//
//*****************************************************************************
volatile unsigned long g_ulButtons = 0;

#define FLAGS_DEVICE_PRESENT    0x00000001

//*****************************************************************************
//
// Holds global flags for the system.
//
//*****************************************************************************
int g_ulFlags = 0;

//*****************************************************************************
//
// The parameters to control the USB mux on the LM3S3748 board.
//
//*****************************************************************************
#define USB_MUX_GPIO_PERIPH     SYSCTL_PERIPH_GPIOH
#define USB_MUX_GPIO_BASE       GPIO_PORTH_BASE
#define USB_MUX_GPIO_PIN        GPIO_PIN_2
#define USB_MUX_SEL_DEVICE      USB_MUX_GPIO_PIN
#define USB_MUX_SEL_HOST        0

//*****************************************************************************
//
// The directory display parameters.
//
//*****************************************************************************
#define NUM_DIR_ENTRIES         ((SCREEN_HEIGHT - TOP_HEIGHT) / FONT_HEIGHT)
#define MAX_DIR_DEPTH           4
#define MAX_FILE_NAME_LEN       (8 + 1 + 3 + 1)  // 8.1 + 1

//*****************************************************************************
//
// The directory state structure.
//
//*****************************************************************************
struct
{
    //
    // Each of the directory entries that are currently valid.
    //
    FILINFO FileInfo[NUM_DIR_ENTRIES];

    //
    // The current position in the directory structure.
    //
    unsigned long ulIndex;

    //
    // What is the currently highlighted selection.
    //
    unsigned long ulSelectIndex;

    //
    // The number of valid values in the directory structure.
    //
    unsigned long ulValidValues;

    //
    // The current directory context.
    //
    DIR DirState;

    //
    // The null terminated string that holds the current directory name.
    //
    char szPWD[MAX_DIR_DEPTH * MAX_FILE_NAME_LEN];
}
g_DirData;

//*****************************************************************************
//
// Hold the current state for the application.
//
//*****************************************************************************
volatile enum
{
    //
    // No device is present.
    //
    STATE_NO_DEVICE,

    //
    // Mass storage device is being enumerated.
    //
    STATE_DEVICE_ENUM,

    //
    // Mass storage device is ready.
    //
    STATE_DEVICE_READY,

    //
    // An unsupported device has been attached.
    //
    STATE_UNKNOWN_DEVICE,

    //
    // A power fault has occured.
    //
    STATE_POWER_FAULT
}
g_eState;

//*****************************************************************************
//
// The control table used by the uDMA controller.  This table must be aligned
// to a 1024 byte boundary.  In this application uDMA is only used for USB,
// so only the first 6 channels are needed.
//
//*****************************************************************************
#if defined(ewarm)
#pragma data_alignment=1024
tDMAControlTable g_sDMAControlTable[6];
#else
tDMAControlTable g_sDMAControlTable[6] __attribute__ ((aligned(1024)));
#endif

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, unsigned long ulLine)
{
}
#endif

//*****************************************************************************
//
// This function clears out the text area used to display the directory
// contents.
//
// \param None.
//
// This function is used to clear out the text area used to display the
// directory contents.
//
// \return None.
//
//*****************************************************************************
void
ClearTextBox(void)
{
    tRectangle TextBox;

    TextBox.sXMin = 0;
    TextBox.sYMin = TOP_HEIGHT;
    TextBox.sXMax = g_sFormike128x128x16.usWidth - 1;
    TextBox.sYMax = g_sFormike128x128x16.usHeight - 1;

    //
    // Set the fill color.
    //
    GrContextForegroundSet(&g_sContext, BACKGROUND_COLOR);

    //
    // Fill the text area with the fill color.
    //
    GrRectFill(&g_sContext, &TextBox);

    GrContextForegroundSet(&g_sContext, FILE_COLOR);
    GrContextBackgroundSet(&g_sContext, ClrBlack);
}

//*****************************************************************************
//
// This function updates the contents of the directory text window.
//
// \param None.
//
// This function is will update the state of the directory window.  This can
// be the result of a DirUpdate() call which completely changed the contents
// of the window, or a selection changed and the screen needs to be updated.
//
// \return None.
//
//*****************************************************************************
void
UpdateWindow(void)
{
    int iIdx;
    int iLine;

    //
    // Set the first line of the directory text window.
    //
    iLine = TOP_HEIGHT;

    //
    // Clear out the text area for the entries.
    //
    ClearTextBox();

    //
    // Display all valid values.
    //
    for(iIdx = 0; iIdx < g_DirData.ulValidValues; iIdx++)
    {
        //
        // Change the backgound for the selected item.
        //
        if(g_DirData.ulSelectIndex == iIdx)
        {
            GrContextBackgroundSet(&g_sContext, ClrGray);
        }
        else
        {
            GrContextBackgroundSet(&g_sContext, ClrBlack);
        }

        //
        // Change the color for directories.
        //
        if (g_DirData.FileInfo[iIdx].fattrib & AM_DIR)
        {
            GrContextForegroundSet(&g_sContext, DIR_COLOR);
            GrStringDraw(&g_sContext, g_DirData.FileInfo[iIdx].fname,
                         100, 0, iLine, 1);
        }
        //
        // Change the color for files.
        //
        else
        {
            GrContextForegroundSet(&g_sContext, FILE_COLOR);
            GrStringDraw(&g_sContext, g_DirData.FileInfo[iIdx].fname,
                         100, 0, iLine, 1);
        }

        //
        // Move down by the height of the characters used.
        //
        iLine += g_sFontFixed6x8.ucHeight;
    }
}

//*****************************************************************************
//
// This function seeks the directory entries in the positive or negative
// direction.
//
// \param iDirSeek is the number of entries to seek by in the positive or
// negative direction.
//
// This function is used to seek up(negative) or down(positive) the list of
// directory entries by the value given in the \e iDirSeek parameter.  If the
// call would cause the seek to go too far at either end the result will
// either be at the first entry in the directory or at the end of the
// directory entry list.
//
// \return None.
//
//*****************************************************************************
int
DirSeek(int iDirSeek)
{
    int iSeek;
    FILINFO FileInfo;

    //
    // If this is a positive seek then just seek by that amount.
    //
    if(iDirSeek >= 0)
    {
        //
        // Simply seek this many forward.
        //
        iSeek = iDirSeek;
    }
    //
    // Seeking in the negative direction is more difficult as FAT has no
    // backward linking.
    //
    else
    {
        //
        // Set the position to seek from 0.
        //
        iSeek = g_DirData.ulIndex + iDirSeek;

        //
        // Rail the value at 0.
        //
        if(iSeek >= 0)
        {
            //
            // Seek from the start of the current directory.
            //
            if (f_opendir(&g_DirData.DirState, g_DirData.szPWD) == FR_OK)
            {
                // what to do?
            }

            //
            // Reset the index to 0.
            //
            g_DirData.ulIndex = 0;
        }
    }

    //
    // Don't do anything else if the seek would go negative.
    //
    if(iSeek < 0)
    {
        return(0);
    }

    //
    // All values are now invalid.
    //
    g_DirData.ulValidValues = 0;

    //
    // Now perform the needed seek which is now, in all cases, a positive seek.
    //
    while(iSeek > 0)
    {
        //
        // Keep reading entries until the correct seek has been completed or
        // there are no more entries.
        //
        if((f_readdir(&g_DirData.DirState, &FileInfo) == FR_OK) &&
            FileInfo.fname[0])
        {
            //
            // Found a valid entry so decrement the remaining number to search
            // for.
            //
            iSeek--;

            //
            // Update the current position in the directory.
            //
            g_DirData.ulIndex++;
        }
        else
        {
            return(0);
        }
    }
    return(1);
}

//*****************************************************************************
//
// This updates the directory window state but not the screen.
//
// \param None.
//
// This function is used to update the names of the directory entries and the
// current state of the diretory contents.  If it is called and there are no
// more directory entries the contents of the directory state is invalidated
// but the screen is not updated.
//
// \return None.
//
//*****************************************************************************
int
DirUpdate(void)
{
    int iIdx;

    iIdx = 0;

    //
    // Move the index value down by the number of entries that were previously
    // on the screen.
    //
    g_DirData.ulIndex += g_DirData.ulValidValues;

    //
    // If at the top and in a directory display the ".." entry.
    //
    if((g_DirData.szPWD[1] != 0) && (g_DirData.ulIndex) == 0)
    {
        //
        // Skip the first entry as we are going to use it for ".." entry.
        //
        iIdx = 1;
        g_DirData.FileInfo[0].fname[0] = '.';
        g_DirData.FileInfo[0].fname[1] = '.';
        g_DirData.FileInfo[0].fname[2] = 0;

        //
        // Force this to a directory entry so that it can be changed to.
        //
        g_DirData.FileInfo[0].fattrib = AM_DIR;
    }

    //
    // There are directory entries remaining, read them out until the buffer
    // is full.
    //
    while((f_readdir(&g_DirData.DirState, &g_DirData.FileInfo[iIdx]) ==
           FR_OK) && (g_DirData.FileInfo[iIdx].fname[0] != 0))
    {
        iIdx++;

        if(iIdx >= NUM_DIR_ENTRIES)
        {
            break;
        }
    }

    //
    // Save the number of valid entries read in.
    //
    g_DirData.ulValidValues = iIdx;

