vkatsageorgiou/Stellarisware-1/boards/ek-lm3s3748/usb_host_msc/usb_host_msc.c
    return(iIdx);
}

//*****************************************************************************
//
// This handles the event when the selection must move up.
//
// \param None.
//
// This function is called when the application wants to move the selection
// point in the directory list up by one element.  This will handle updating
// the directory contents if necessary or just updating the screen.
//
// \return None.
//
//*****************************************************************************
void
MoveDown(void)
{
    //
    // If the selection is moving to the next screen, then update the contents
    // and the display.
    //
    if(g_DirData.ulValidValues <= (g_DirData.ulSelectIndex + 1))
    {
        //
        // If the contents of the directory update successfully, then update
        // the screen.
        //
        if(DirUpdate() != 0)
        {
            //
            // Move the selection back to the first entry.
            //
            g_DirData.ulSelectIndex = 0;

            //
            // Update the display.
            //
            UpdateWindow();
        }
    }
    else
    {
        //
        // Just update the selection and update the display.
        //
        g_DirData.ulSelectIndex++;
        UpdateWindow();
    }
}

//*****************************************************************************
//
// This handles the event when the selection must move down.
//
// \param None.
//
// This function is called when the application wants to move the selection
// point in the directory list down by one element.  This will handle updating
// the directory contents if necessary or just updating the screen.
//
// \return None.
//
//*****************************************************************************
void
MoveUp(void)
{
    int iSeek;

    //
    // If the selection is at the top, then there will need to be a directory
    // update.
    //
    if(g_DirData.ulSelectIndex == 0)
    {
        //
        // Seek by at least one page of entries.
        //
        iSeek = -NUM_DIR_ENTRIES;

        //
        // Need to go up one extra if we were right at the top and seeked
        // up to skip the first entry on the old page.
        //
        if(g_DirData.ulValidValues == 0)
        {
            iSeek--;
        }

        //
        // Seek back one page in the directory structure.
        //
        if(DirSeek(iSeek))
        {
            //
            // Set the selection to the last element on the screen and update
            // the directory contents.
            //
            g_DirData.ulSelectIndex = NUM_DIR_ENTRIES - 1;
            DirUpdate();
        }
    }
    else
    {
        //
        // Not at the top of the screen so if there are no valid values, read
        // just enough to refresh the current values that may have been
        // erased by seeking past the end of the directory.
        //
        if(g_DirData.ulValidValues == 0)
        {
            DirSeek(-(g_DirData.ulSelectIndex + 1));
            DirUpdate();
        }

        //
        // Move the selection up by one.
        //
        g_DirData.ulSelectIndex--;
    }

    //
    // Update the display.
    //
    UpdateWindow();
}

//*****************************************************************************
//
// This handles the event when the selection is pressed.
//
// \param None.
//
// This function is called when the application wants to check if the selection
// should perform any action.  At this point it will only act on directories
// by changing into that directory and displaying its contents.
//
// \return None.
//
//*****************************************************************************
void
SelectDir(void)
{
    int iIdx;

    //
    // Only operate on directories.
    //
    if(g_DirData.FileInfo[g_DirData.ulSelectIndex].fattrib & AM_DIR)
    {
        //
        // Look for the special ".." entry.
        //
        if((g_DirData.FileInfo[g_DirData.ulSelectIndex].fname[0] == '.') &&
           (g_DirData.FileInfo[g_DirData.ulSelectIndex].fname[1] == '.'))
        {
            //
            // Find the end of the current directory.
            //
            iIdx = strlen(g_DirData.szPWD);

            //
            // Look backwards through the string for the last "/"
            //
            while(iIdx != 0)
            {
                if(g_DirData.szPWD[iIdx] == '/')
                {
                    g_DirData.szPWD[iIdx] = 0;
                    break;
                }

                iIdx--;
            }

            //
            // If none was found then go back to the root directory.
            //
            if(iIdx == 0)
            {
                g_DirData.szPWD[1] = 0;
            }

            //
            // If the directory open fails, then just return for now
            // this will result in no update.
            //
            if (f_opendir(&g_DirData.DirState, g_DirData.szPWD) != FR_OK)
            {
                return;
            }
        }
        else
        {
            //
            // Find the end of the directory.
            //
            iIdx = strlen(g_DirData.szPWD);

            //
            // Don't append if at the root.
            //
            if(iIdx != 1)
            {
                g_DirData.szPWD[iIdx] = '/';
                g_DirData.szPWD[iIdx+1] = 0;
            }

            //
            // Append the new directory to the current directory.
            //
            strcat(g_DirData.szPWD,
                   g_DirData.FileInfo[g_DirData.ulSelectIndex].fname);

            //
            // Read from the start of the current directory.
            //
            if (f_opendir(&g_DirData.DirState, g_DirData.szPWD) != FR_OK)
            {
                //
                // If the directory open fails, then just return for now
                // this will result in no update.
                //
                return;
            }
        }

        //
        // Reset the state of the directory structure and update the
        // contents.
        //
        g_DirData.ulIndex = 0;
        g_DirData.ulSelectIndex = 0;
        g_DirData.ulValidValues = 0;
        DirUpdate();

        //
        // Update the display.
        //
        UpdateWindow();
    }
}

//*****************************************************************************
//
// Initializes the file system module.
//
// \param None.
//
// This function initializes the third party FAT implementation.
//
// \return Returns \e true on success or \e false on failure.
//
//*****************************************************************************
tBoolean
FileInit(void)
{
    //
    // Mount the file system, using logical disk 0.
    //
    if(f_mount(0, &g_sFatFs) != FR_OK)
    {
        return(false);
    }
    return(true);
}

//*****************************************************************************
//
// This is the callback from the MSC driver.
//
// \param ulInstance is the driver instance which is needed when communicating
// with the driver.
// \param ulEvent is one of the events defined by the driver.
// \param pvData is a pointer to data passed into the initial call to register
// the callback.
//
// This function handles callback events from the MSC driver.  The only events
// currently handled are the MSC_EVENT_OPEN and MSC_EVENT_CLOSE.  This allows
// the main routine to know when an MSC device has been detected and
// enumerated and when an MSC device has been removed from the system.
//
// \return Returns \e true on success or \e false on failure.
//
//*****************************************************************************
void
MSCCallback(unsigned long ulInstance, unsigned long ulEvent, void *pvData)
{
    //
    // Determine the event.
    //
    switch(ulEvent)
    {
        //
        // Called when the device driver has successfully enumerated an MSC
        // device.
        //
        case MSC_EVENT_OPEN:
        {
            //
            // Proceed to the enumeration state.
            //
            g_eState = STATE_DEVICE_ENUM;
            break;
        }

        //
        // Called when the device driver has been unloaded due to error or
        // the device is no longer present.
        //
        case MSC_EVENT_CLOSE:
        {
            //
            // Go back to the "no device" state and wait for a new connection.
            //
            g_eState = STATE_NO_DEVICE;

            //
            // Re-initialize the file system.
            //
            FileInit();

            break;
        }

        default:
        {
            break;
        }
    }
}

//*****************************************************************************
//
// This is the generic callback from host stack.
//
// \param pvData is actually a pointer to a tEventInfo structure.
//
// This function will be called to inform the application when a USB event has
// occured that is outside those releated to the mass storage device.  At this
// point this is used to detect unsupported devices being inserted and removed.
// It is also used to inform the application when a power fault has occured.
// This function is required when the g_USBGenericEventDriver is included in
// the host controller driver array that is passed in to the
// USBHCDRegisterDrivers() function.
//
// \return None.
//
//*****************************************************************************
void
USBHCDEvents(void *pvData)
{
    tEventInfo *pEventInfo;

    //
    // Cast this pointer to its actual type.
    //
    pEventInfo = (tEventInfo *)pvData;

    switch(pEventInfo->ulEvent)
    {
        //
        // New keyboard detected.
        //
        case USB_EVENT_CONNECTED:
        {
            //
            // An unknown device was detected.
            //
            g_eState = STATE_UNKNOWN_DEVICE;

            break;
        }

        //
        // Keyboard has been unplugged.
        //
        case USB_EVENT_DISCONNECTED:
        {
            //
            // Unknown device has been removed.
            //
            g_eState = STATE_NO_DEVICE;

            break;
        }
        case USB_EVENT_POWER_FAULT:
        {
            //
            // No power means no device is present.
            //
            g_eState = STATE_POWER_FAULT;

            break;
        }
        default:
        {
            break;
        }
    }
}

//*****************************************************************************
//
// This is interrupt handler for the systick interrupt.
//
// This function handles the interrupts generated by the system tick.  These
// are used for button debouncing and updating the state of the buttons.
// The buttons are stored in a bitmask indicating which buttons have been
// release.  If a button is pressed twice, only one press will be seen.  There
// is no press and hold detection.
//
// \return None.
//
//*****************************************************************************
void
SysTickHandler(void)
{
    unsigned char ucButtons;
    unsigned char ucChanged;
    unsigned char ucRepeat;

    //
    // Determine the state of the pushbuttons.
    //
    ucButtons = ButtonsPoll(&ucChanged, &ucRepeat);

    //
    // Up button has been released.
    //
    if(BUTTON_RELEASED(UP_BUTTON, ucButtons, ucChanged))
    {
        g_ulButtons |= BUTTON_UP_CLICK;
    }

    //
    // Up button has been held.
    //
    if(BUTTON_REPEAT(UP_BUTTON, ucRepeat))
    {
        g_ulButtons |= BUTTON_UP_CLICK;
    }

    //
    // Down button has been released.
    //
    if(BUTTON_RELEASED(DOWN_BUTTON, ucButtons, ucChanged))
    {
        g_ulButtons |= BUTTON_DOWN_CLICK;
    }

    //
    // Down button has been held.
    //
    if(BUTTON_REPEAT(DOWN_BUTTON, ucRepeat))
    {
        g_ulButtons |= BUTTON_DOWN_CLICK;
    }

    //
    // Left button has been released.
    //
    if(BUTTON_RELEASED(LEFT_BUTTON, ucButtons, ucChanged))
    {
        g_ulButtons |= BUTTON_LEFT_CLICK;
    }

    //
    // Right button has been released.
    //
    if(BUTTON_RELEASED(RIGHT_BUTTON, ucButtons, ucChanged))
    {
        g_ulButtons |= BUTTON_RIGHT_CLICK;
    }

    //
    // Select button has been released.
    //
    if(BUTTON_RELEASED(SELECT_BUTTON, ucButtons, ucChanged))
    {
        g_ulButtons |= BUTTON_SELECT_CLICK;
    }
}

//*****************************************************************************
//
// This is the main loop that runs the application.
//
//*****************************************************************************
int
main(void)
{
    FRESULT FileResult;
    tRectangle sRect;

    //
    // Initially wait for device connection.
    //
    g_eState = STATE_NO_DEVICE;

    //
    // Set the clocking to run directly from the crystal.
    //
    SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN |
                   SYSCTL_XTAL_8MHZ);

    //
    // Enable Clocking to the USB controller.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_USB0);

    //
    // Enable the peripherals used by this example.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOH);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);

    //
    // Set the USB pins to be controlled by the USB controller.
    //
    GPIOPinTypeUSBDigital(GPIO_PORTH_BASE, GPIO_PIN_3 | GPIO_PIN_4);

    //
    // The LM3S3748 board uses a USB mux that must be switched to use the
    // host connecter and not the device connecter.
    //
    GPIOPinTypeGPIOOutput(USB_MUX_GPIO_BASE, USB_MUX_GPIO_PIN);
    GPIOPinWrite(USB_MUX_GPIO_BASE, USB_MUX_GPIO_PIN, USB_MUX_SEL_HOST);

    //
    // Turn on USB Phy clock.
    //
    SysCtlUSBPLLEnable();

    //
    // Set the system tick to fire 100 times per second.
    //
    SysTickPeriodSet(SysCtlClockGet()/100);
    SysTickIntEnable();
    SysTickEnable();

    //
    // Enable the uDMA controller and set up the control table base.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
    uDMAEnable();
    uDMAControlBaseSet(g_sDMAControlTable);

    //
    // Initialize the display driver.
    //
    Formike128x128x16Init();

    //
    // Turn on the backlight.
    //
    Formike128x128x16BacklightOn();

    //
    // Initialize the graphics context.
    //
    GrContextInit(&g_sContext, &g_sFormike128x128x16);

    //
    // Fill the top 15 rows of the screen with blue to create the banner.
    //
    sRect.sXMin = 0;
    sRect.sYMin = 0;
    sRect.sXMax = GrContextDpyWidthGet(&g_sContext) - 1;
    sRect.sYMax = SPLASH_HEIGHT - 1;
    GrContextForegroundSet(&g_sContext, ClrDarkBlue);
    GrRectFill(&g_sContext, &sRect);

    //
    // Put a white box around the banner.
    //
    GrContextForegroundSet(&g_sContext, ClrWhite);
    GrRectDraw(&g_sContext, &sRect);

    //
    // Put the application name in the middle of the banner.
    //
    GrContextFontSet(&g_sContext, &g_sFontFixed6x8);

    GrStringDrawCentered(&g_sContext, "usb_host_msc", -1,
                         GrContextDpyWidthGet(&g_sContext) / 2, 7, 0);

    //
    // Set the color to white and select the 20 point font.
    //
    GrContextForegroundSet(&g_sContext, FILE_COLOR);

